williams-one/n6-debug-test/STM32N6570-DK.ioc
#MicroXplorer Configuration settings - do not modify
Appli.IPs=CORTEX_M55_S,GPDMA1,HPDMA1,LINKEDLIST,RCC,RIF,GPIO,NVIC1\:I,JPEG,ICACHE,SYS_S,TIM2,I2C2,DMA2D\:I,GPU2D,LTDC,CRC,THREADX,STMicroelectronics.X-CUBE-TOUCHGFX.4.25.0_Appli\:I,SAU\:I,RAMCFG
Appli.Pins=PQ6,PE9,PQ3,PQ4,PD0,PD5,PC13,PE1,PO1,PF6,PG10
CAD.formats=
CAD.pinconfig=
CAD.provider=
CORTEX_M55_S.AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_ALL_RW
CORTEX_M55_S.AccessPermission-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_ALL_RW
CORTEX_M55_S.AccessPermission-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_ALL_RO
CORTEX_M55_S.AccessPermission-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_REGION_ALL_RO
CORTEX_M55_S.AccessPermission-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_REGION_PRIV_RO
CORTEX_M55_S.AllocateAttribute0=MPU_R_ALLOCATE
CORTEX_M55_S.AllocateAttribute1=MPU_R_ALLOCATE
CORTEX_M55_S.Attributes0=MPU_ATTRIBUTES_NUMBER0
CORTEX_M55_S.Attributes1=MPU_ATTRIBUTES_NUMBER1
CORTEX_M55_S.Attributes2=MPU_ATTRIBUTES_NUMBER2
CORTEX_M55_S.Attributes3=MPU_ATTRIBUTES_NUMBER3
CORTEX_M55_S.AttributesIndex-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_ATTRIBUTES_NUMBER3
CORTEX_M55_S.AttributesIndex-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_ATTRIBUTES_NUMBER2
CORTEX_M55_S.AttributesIndex-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_ATTRIBUTES_NUMBER1
CORTEX_M55_S.AttributesIndex-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_ATTRIBUTES_NUMBER0
CORTEX_M55_S.AttributesIndex-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_ATTRIBUTES_NUMBER1
CORTEX_M55_S.BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings=0x34140000
CORTEX_M55_S.BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings=0x34146000
CORTEX_M55_S.BaseAddress-Cortex_Memory_Protection_Unit_Region2_Settings=0x70100400
CORTEX_M55_S.BaseAddress-Cortex_Memory_Protection_Unit_Region3_Settings=0x70200000
CORTEX_M55_S.BaseAddress-Cortex_Memory_Protection_Unit_Region4_Settings=0x34000400
CORTEX_M55_S.CPU_DCache=Enabled
CORTEX_M55_S.CPU_ICache=Enabled
CORTEX_M55_S.CacheableAttribute0=MPU_WRITE_BACK
CORTEX_M55_S.CacheableAttribute1=MPU_WRITE_BACK
CORTEX_M55_S.DeviceAttribute0=MPU_DEVICE_GRE
CORTEX_M55_S.DeviceAttribute1=MPU_DEVICE_NGNRNE
CORTEX_M55_S.DeviceAttribute2=MPU_DEVICE_NGNRNE
CORTEX_M55_S.DeviceAttribute3=MPU_DEVICE_GRE
CORTEX_M55_S.DisableExec-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M55_S.DisableExec-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M55_S.DisableExec-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
CORTEX_M55_S.Enable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_ENABLE
CORTEX_M55_S.Enable-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_ENABLE
CORTEX_M55_S.Enable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_ENABLE
CORTEX_M55_S.Enable-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_REGION_ENABLE
CORTEX_M55_S.Enable-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_REGION_ENABLE
CORTEX_M55_S.IPParameters=CPU_ICache,CPU_DCache,MPU_Control,Enable-Cortex_Memory_Protection_Unit_Region0_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings,LimitAddress-Cortex_Memory_Protection_Unit_Region0_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region0_Settings,DeviceAttribute0,Enable-Cortex_Memory_Protection_Unit_Region1_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings,LimitAddress-Cortex_Memory_Protection_Unit_Region1_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region1_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region1_Settings,DeviceAttribute1,Enable-Cortex_Memory_Protection_Unit_Region2_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region2_Settings,LimitAddress-Cortex_Memory_Protection_Unit_Region2_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region2_Settings,Enable-Cortex_Memory_Protection_Unit_Region3_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region3_Settings,LimitAddress-Cortex_Memory_Protection_Unit_Region3_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region3_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region3_Settings,Attributes0,Memorytype0,AllocateAttribute0,TransientAttribute0,CacheableAttribute0,AttributesIndex-Cortex_Memory_Protection_Unit_Region3_Settings,Attributes1,Memorytype1,AllocateAttribute1,TransientAttribute1,CacheableAttribute1,AttributesIndex-Cortex_Memory_Protection_Unit_Region2_Settings,Attributes2,Memorytype2,DeviceAttribute2,AttributesIndex-Cortex_Memory_Protection_Unit_Region1_Settings,Attributes3,Memorytype3,DeviceAttribute3,AttributesIndex-Cortex_Memory_Protection_Unit_Region0_Settings,Enable-Cortex_Memory_Protection_Unit_Region4_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region4_Settings,LimitAddress-Cortex_Memory_Protection_Unit_Region4_Settings,AttributesIndex-Cortex_Memory_Protection_Unit_Region4_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region4_Settings
CORTEX_M55_S.LimitAddress-Cortex_Memory_Protection_Unit_Region0_Settings=0x34145FFF
CORTEX_M55_S.LimitAddress-Cortex_Memory_Protection_Unit_Region1_Settings=0x3441FFFF
CORTEX_M55_S.LimitAddress-Cortex_Memory_Protection_Unit_Region2_Settings=0x701FFFFF
CORTEX_M55_S.LimitAddress-Cortex_Memory_Protection_Unit_Region3_Settings=0x77FFFFFF
CORTEX_M55_S.LimitAddress-Cortex_Memory_Protection_Unit_Region4_Settings=0x340FFFFF
CORTEX_M55_S.MPU_Control=MPU_PRIVILEGED_DEFAULT
CORTEX_M55_S.Memorytype0=MPU_CACHEABLE
CORTEX_M55_S.Memorytype1=MPU_CACHEABLE
CORTEX_M55_S.Memorytype2=MPU_DEVICE
CORTEX_M55_S.Memorytype3=MPU_DEVICE
CORTEX_M55_S.TransientAttribute0=MPU_TRANSIENT
CORTEX_M55_S.TransientAttribute1=MPU_NON_TRANSIENT
EXTMEM_MANAGER.IPParameters=RefParam_BOOT_enable,RefParam_MEMORY_1_Instance,RefParam_MEMORY_1_ConfigType,RefParam_MEMORY_2_Driver_Selection,RefParam_MEMORY_2_ConfigType,RefParam_MEMORY_2_NumberOfConfig,RefParam_BOOT_selection,RefParam_LRUN_SRC_offset,RefParam_LRUN_SRC_size,RefParam_LRUN_DEST_offset
EXTMEM_MANAGER.RefParam_BOOT_enable=true
EXTMEM_MANAGER.RefParam_BOOT_selection=LRUN
EXTMEM_MANAGER.RefParam_LRUN_DEST_offset=0x34000000
EXTMEM_MANAGER.RefParam_LRUN_SRC_offset=0x100000
EXTMEM_MANAGER.RefParam_LRUN_SRC_size=0x100000
EXTMEM_MANAGER.RefParam_MEMORY_1_ConfigType=EXTMEM_LINK_CONFIG_8LINES
EXTMEM_MANAGER.RefParam_MEMORY_1_Instance=XSPI2
EXTMEM_MANAGER.RefParam_MEMORY_2_ConfigType=EXTMEM_LINK_CONFIG_16LINES
EXTMEM_MANAGER.RefParam_MEMORY_2_Driver_Selection=EXTMEM_PSRAM
EXTMEM_MANAGER.RefParam_MEMORY_2_NumberOfConfig=1
ExtMemLoader.IPs=EXTMEM_LOADER,EXTMEM_MANAGER,RCC\:I,GPIO
FSBL.IPs=CORTEX_M55_FSBL,GPDMA1\:I,HDP,HPDMA1\:I,LINKEDLIST,RCC,GPIO\:I,NVIC\:I,XSPI1,XSPI2,XSPIM,EXTMEM_MANAGER,PWR\:I,BSEC
FSBL.Pins=PF4
File.Version=6
GPIO.groupedBy=Group By Peripherals
HPDMA1.DATAALIGNEMENT_HPDMACH0=DMA_DATA_PACK
HPDMA1.DATAHANDLING_HPDMACH0=ENABLE
HPDMA1.DESTBURSTLENGTH_HPDMACH0=8
HPDMA1.DESTBURSTLENGTH_HPDMACH1=8
HPDMA1.DESTDATAWIDTH_HPDMACH0=DMA_DEST_DATAWIDTH_WORD
HPDMA1.DESTDATAWIDTH_HPDMACH1=DMA_DEST_DATAWIDTH_WORD
HPDMA1.DESTINC_HPDMACH1=DMA_DINC_INCREMENTED
HPDMA1.DIRECTION_HPDMACH0=DMA_MEMORY_TO_PERIPH
HPDMA1.IPParameters=RECAP_HPDMACH0,RECAP_HPDMACH1,ISOLATION_HPDMACH1,ISOLATION_HPDMACH0,REQUEST_HPDMACH1,PRIORITY_HPDMACH1,SRCDATAWIDTH_HPDMACH1,SRCBURSTLENGTH_HPDMACH1,TRANSFERALLOCATEDPORTSRC_HPDMACH1,DESTINC_HPDMACH1,DESTDATAWIDTH_HPDMACH1,DESTBURSTLENGTH_HPDMACH1,REQUEST_HPDMACH0,PRIORITY_HPDMACH0,DIRECTION_HPDMACH0,SRCINC_HPDMACH0,SRCBURSTLENGTH_HPDMACH0,DESTDATAWIDTH_HPDMACH0,DESTBURSTLENGTH_HPDMACH0,DATAHANDLING_HPDMACH0,DATAALIGNEMENT_HPDMACH0,TRANSFERALLOCATEDPORTDEST_HPDMACH0
HPDMA1.ISOLATION_HPDMACH0=DMA_ISOLATION_ON
HPDMA1.ISOLATION_HPDMACH1=DMA_ISOLATION_ON
HPDMA1.PRIORITY_HPDMACH0=DMA_HIGH_PRIORITY
HPDMA1.PRIORITY_HPDMACH1=DMA_HIGH_PRIORITY
HPDMA1.RECAP_HPDMACH0=HPDMA1_REQUEST_JPEG_RX
HPDMA1.RECAP_HPDMACH1=HPDMA1_REQUEST_JPEG_TX
HPDMA1.REQUEST_HPDMACH0=HPDMA1_REQUEST_JPEG_RX
HPDMA1.REQUEST_HPDMACH1=HPDMA1_REQUEST_JPEG_TX
HPDMA1.SRCBURSTLENGTH_HPDMACH0=8
HPDMA1.SRCBURSTLENGTH_HPDMACH1=8
HPDMA1.SRCDATAWIDTH_HPDMACH1=DMA_SRC_DATAWIDTH_WORD
HPDMA1.SRCINC_HPDMACH0=DMA_SINC_INCREMENTED
HPDMA1.TRANSFERALLOCATEDPORTDEST_HPDMACH0=DMA_DEST_ALLOCATED_PORT1
HPDMA1.TRANSFERALLOCATEDPORTSRC_HPDMACH1=DMA_SRC_ALLOCATED_PORT1
I2C2.I2C_Speed_Mode=I2C_Fast
I2C2.IPParameters=Timing,I2C_Speed_Mode
I2C2.Timing=0x109035B7
JPEG.IPParameters=USE_JPEG_ENCODER,JPEG_RGB_FORMAT
JPEG.JPEG_RGB_FORMAT=JPEG_RGB565
JPEG.USE_JPEG_ENCODER=0
KeepUserPlacement=false
LTDC.ActiveW=800
LTDC.Alpha_L0=255
LTDC.HBP=8
LTDC.HFP=8
LTDC.HSync=5
LTDC.IPParameters=Layers,HSync,HBP,ActiveW,HFP,VSync,VBP,VFP,WindowX1_L0,WindowY1_L0,PixelFormat_L0,ImageWidth_L0,ImageHeight_L0,Alpha_L0
LTDC.ImageHeight_L0=480
LTDC.ImageWidth_L0=800
LTDC.Layers=0
LTDC.PixelFormat_L0=LTDC_PIXEL_FORMAT_RGB565
LTDC.VBP=8
LTDC.VFP=14
LTDC.VSync=5
LTDC.WindowX1_L0=800
LTDC.WindowY1_L0=480
Mcu.CPN=STM32N657X0H3Q
Mcu.Context0=FSBL
Mcu.Context1=Appli
Mcu.Context2=ExtMemLoader
Mcu.ContextNb=3
Mcu.ContextProject=FullSecure
Mcu.Family=STM32N6
Mcu.IP0=BSEC
Mcu.IP1=CORTEX_M55_FSBL
Mcu.IP10=JPEG
Mcu.IP11=LTDC
Mcu.IP12=NVIC1
Mcu.IP13=NVIC
Mcu.IP14=PWR
Mcu.IP15=RAMCFG
Mcu.IP16=RCC
Mcu.IP17=RIF
Mcu.IP18=SYS_S
Mcu.IP19=THREADX
Mcu.IP2=CORTEX_M55_S
Mcu.IP20=XSPI1
Mcu.IP21=XSPI2
Mcu.IP22=XSPIM
Mcu.IP3=CRC
Mcu.IP4=DMA2D
Mcu.IP5=EXTMEM_MANAGER
Mcu.IP6=GPU2D
Mcu.IP7=HPDMA1
Mcu.IP8=I2C2
Mcu.IP9=ICACHE
Mcu.IPNb=23
Mcu.Name=STM32N657X0HxQ
Mcu.Package=VFBGA264
Mcu.Pin0=PQ6
Mcu.Pin1=PH0-OSC_IN(PH0)
Mcu.Pin10=PB13
Mcu.Pin11=PB2
Mcu.Pin12=PQ3
Mcu.Pin13=PQ4
Mcu.Pin14=PD0
Mcu.Pin15=PD5
Mcu.Pin16=PB15
Mcu.Pin17=PE11
Mcu.Pin18=PD8
Mcu.Pin19=PC13
Mcu.Pin2=PE9
Mcu.Pin20=PH4
Mcu.Pin21=PE1
Mcu.Pin22=PP7
Mcu.Pin23=PP6
Mcu.Pin24=PP0
Mcu.Pin25=PD9
Mcu.Pin26=PP4
Mcu.Pin27=PP1
Mcu.Pin28=PP15
Mcu.Pin29=PP5
Mcu.Pin3=PH3
Mcu.Pin30=PP12
Mcu.Pin31=PP3
Mcu.Pin32=PP2
Mcu.Pin33=PP13
Mcu.Pin34=PO1
Mcu.Pin35=PO2
Mcu.Pin36=PF4
Mcu.Pin37=PG6
Mcu.Pin38=PF6
Mcu.Pin39=PP11
Mcu.Pin4=PH6
Mcu.Pin40=PP8
Mcu.Pin41=PP14
Mcu.Pin42=PF5
Mcu.Pin43=PO3
Mcu.Pin44=PO0
Mcu.Pin45=PP9
Mcu.Pin46=PP10
Mcu.Pin47=PO4
Mcu.Pin48=PN4
Mcu.Pin49=PA1
Mcu.Pin5=PH1-OSC_OUT(PH1)
Mcu.Pin50=PB11
Mcu.Pin51=PA15(JTDI)
Mcu.Pin52=PN6
Mcu.Pin53=PN8
Mcu.Pin54=PN0
Mcu.Pin55=PG15
Mcu.Pin56=PG1
Mcu.Pin57=PB12
Mcu.Pin58=PA7
Mcu.Pin59=PG0
Mcu.Pin6=PD15
Mcu.Pin60=PN3
Mcu.Pin61=PN5
Mcu.Pin62=PN1
Mcu.Pin63=PA2
Mcu.Pin64=PG10
Mcu.Pin65=PB4(NJTRST)
Mcu.Pin66=PG8
Mcu.Pin67=PN9
Mcu.Pin68=PN2
Mcu.Pin69=PA8
Mcu.Pin7=PD4
Mcu.Pin70=PG13
Mcu.Pin71=PA0
Mcu.Pin72=PG11
Mcu.Pin73=PN10
Mcu.Pin74=PN11
Mcu.Pin75=VP_BSEC_VS_BSEC
Mcu.Pin76=VP_CRC_VS_CRC
Mcu.Pin77=VP_DMA2D_VS_DMA2D
Mcu.Pin78=VP_EXTMEM_MANAGER_SIG_Activate_EXTMEM
Mcu.Pin79=VP_GPU2D_VS_GPU2D
Mcu.Pin8=PB14
Mcu.Pin80=VP_HPDMA1_VS_HPDMACH0
Mcu.Pin81=VP_HPDMA1_VS_HPDMACH1
Mcu.Pin82=VP_ICACHE_VS_ICACHE
Mcu.Pin83=VP_ICACHE_VS_SECURE_ICACHE_REG
Mcu.Pin84=VP_JPEG_VS_JPEG
Mcu.Pin85=VP_PWR_VS_SECSignals
Mcu.Pin86=VP_PWR_VS_LPOM
Mcu.Pin87=VP_PWR_VS_DBSignals
Mcu.Pin88=VP_PWR_VS_PowerVDDIO
Mcu.Pin89=VP_RAMCFG_VS_RAMCFG3
Mcu.Pin9=PD14
Mcu.Pin90=VP_RAMCFG_VS_RAMCFG4
Mcu.Pin91=VP_RAMCFG_VS_RAMCFG5
Mcu.Pin92=VP_RAMCFG_VS_RAMCFG6
Mcu.Pin93=VP_RIF_VS_RIF1
Mcu.Pin94=VP_SYS_S_VS_tim2
Mcu.Pin95=VP_THREADX_VS_RTOSJjThreadXJjCoreJjDefault
Mcu.Pin96=VP_XSPI1_VS_hexa
Mcu.Pin97=VP_XSPI2_VS_octo
Mcu.Pin98=VP_XSPIM_VS_IO
Mcu.Pin99=VP_STMicroelectronics.X-CUBE-TOUCHGFX_Appli_VS_GraphicsJjApplication_4.25.0
Mcu.PinsNb=100
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-TOUCHGFX.4.25.0
Mcu.ThirdParty0_ContextShortName=Appli
Mcu.ThirdParty0_Instance=STMicroelectronics.X-CUBE-TOUCHGFX.4.25.0_Appli
Mcu.ThirdPartyNb=1
Mcu.UserConstants=
Mcu.UserName=STM32N657X0HxQ
MxCube.Version=6.14.0
MxDb.Version=DB.6.0.140
NVIC.BFHFNMINS=0
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PRIS=0
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.BFHFNMINS=0
NVIC1.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC1.DMA2D_IRQn=true\:9\:0\:true\:false\:true\:false\:true\:true\:true
NVIC1.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC1.EXTI4_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true\:true
NVIC1.ForceEnableDMAVector=true
NVIC1.GPU2D_ER_IRQn=true\:5\:0\:true\:false\:true\:false\:true\:true\:true
NVIC1.GPU2D_IRQn=true\:9\:0\:true\:false\:true\:false\:true\:true\:true
NVIC1.HPDMA1_Channel0_IRQn=true\:6\:0\:true\:false\:true\:true\:false\:true\:true
NVIC1.HPDMA1_Channel1_IRQn=true\:7\:0\:true\:false\:true\:true\:false\:true\:true
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC1.ICACHE_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true\:true
NVIC1.JPEG_IRQn=true\:8\:0\:true\:false\:true\:false\:true\:true\:true
NVIC1.LTDC_UP_ERR_IRQn=true\:5\:0\:true\:false\:true\:false\:true\:true\:true
NVIC1.LTDC_UP_IRQn=true\:9\:0\:true\:false\:true\:false\:true\:true\:true
NVIC1.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC1.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC1.PRIS=0
NVIC1.PendSV_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false\:false
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false\:false
NVIC1.SavedPendsvIrqHandlerGenerated=true
NVIC1.SavedSvcallIrqHandlerGenerated=true
NVIC1.SavedSystickIrqHandlerGenerated=true
NVIC1.SecureFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC1.SysTick_IRQn=true\:14\:0\:false\:false\:false\:false\:false\:true\:false
NVIC1.TIM2_IRQn=true\:5\:0\:true\:false\:true\:false\:false\:true\:true
NVIC1.TimeBase=TIM2_IRQn
NVIC1.TimeBaseIP=TIM2
NVIC1.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
PA0.GPIOParameters=PinAttribute
PA0.Mode=RGB888
PA0.PinAttribute=Appli
PA0.Signal=LTDC_G3
PA1.GPIOParameters=PinAttribute
PA1.Mode=RGB888
PA1.PinAttribute=Appli
PA1.Signal=LTDC_G2
PA15(JTDI).GPIOParameters=PinAttribute
PA15(JTDI).Mode=RGB888
PA15(JTDI).PinAttribute=Appli
PA15(JTDI).Signal=LTDC_R5
PA2.GPIOParameters=PinAttribute
PA2.Locked=true
PA2.Mode=RGB888
PA2.PinAttribute=Appli
PA2.Signal=LTDC_B7
PA7.GPIOParameters=PinAttribute
PA7.Locked=true
PA7.Mode=RGB888
PA7.PinAttribute=Appli
PA7.Signal=LTDC_B1
PA8.GPIOParameters=PinAttribute
PA8.Mode=RGB888
PA8.PinAttribute=Appli
PA8.Signal=LTDC_B6
PB11.GPIOParameters=PinAttribute
PB11.Mode=RGB888
PB11.PinAttribute=Appli
PB11.Signal=LTDC_G6
PB12.GPIOParameters=PinAttribute
PB12.Mode=RGB888
PB12.PinAttribute=Appli
PB12.Signal=LTDC_G5
PB13.GPIOParameters=PinAttribute
PB13.Mode=RGB888
PB13.PinAttribute=Appli
PB13.Signal=LTDC_CLK
PB14.GPIOParameters=PinAttribute
PB14.Mode=RGB888
PB14.PinAttribute=Appli
PB14.Signal=LTDC_HSYNC
PB15.GPIOParameters=PinAttribute
PB15.Mode=RGB888
PB15.PinAttribute=Appli
PB15.Signal=LTDC_G4
PB2.GPIOParameters=PinAttribute
PB2.Mode=RGB888
PB2.PinAttribute=Appli
PB2.Signal=LTDC_B2
PB4(NJTRST).GPIOParameters=PinAttribute
PB4(NJTRST).Mode=RGB888
PB4(NJTRST).PinAttribute=Appli
PB4(NJTRST).Signal=LTDC_R3
PC13.ContextOwner=Appli
PC13.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PC13.GPIO_Label=USER_BUTTON_1
PC13.GPIO_PuPd=GPIO_PULLDOWN
PC13.Locked=true
PC13.PinAttribute=Appli
PC13.Signal=GPIO_Input
PD0.ContextOwner=Appli
PD0.GPIOParameters=GPIO_Label,PinAttribute
PD0.GPIO_Label=FRAME_RATE
PD0.Locked=true
PD0.PinAttribute=Appli
PD0.Signal=GPIO_Output
PD14.GPIOParameters=PinAttribute
PD14.Mode=I2C
PD14.PinAttribute=Appli
PD14.Signal=I2C2_SCL
PD15.GPIOParameters=PinAttribute
PD15.Mode=RGB888
PD15.PinAttribute=Appli
PD15.Signal=LTDC_R2
PD4.GPIOParameters=PinAttribute
PD4.Locked=true
PD4.Mode=I2C
PD4.PinAttribute=Appli
PD4.Signal=I2C2_SDA
PD5.ContextOwner=Appli
PD5.GPIOParameters=GPIO_Label,PinAttribute
PD5.GPIO_Label=RENDER_TIME
PD5.Locked=true
PD5.PinAttribute=Appli
PD5.Signal=GPIO_Output
PD8.GPIOParameters=PinAttribute
PD8.Mode=RGB888
PD8.PinAttribute=Appli
PD8.Signal=LTDC_R7
PD9.GPIOParameters=PinAttribute
PD9.Mode=RGB888
PD9.PinAttribute=Appli
PD9.Signal=LTDC_R1
PE1.ContextOwner=Appli
PE1.GPIOParameters=PinState,GPIO_Label,PinAttribute
PE1.GPIO_Label=LCD_RESET
PE1.Locked=true
PE1.PinAttribute=Appli
PE1.PinState=GPIO_PIN_SET
PE1.Signal=GPIO_Output
PE11.GPIOParameters=PinAttribute
PE11.Mode=RGB888
PE11.PinAttribute=Appli
PE11.Signal=LTDC_VSYNC
PE9.ContextOwner=Appli
PE9.GPIOParameters=GPIO_Label,PinAttribute
PE9.GPIO_Label=MCU_ACTIVE
PE9.Locked=true
PE9.PinAttribute=Appli
PE9.Signal=GPIO_Output
PF4.ContextOwner=FSBL
PF4.GPIOParameters=PinState,GPIO_Label,PinAttribute
PF4.GPIO_Label=VDDCORE_OVERDRIVE
PF4.Locked=true
PF4.PinAttribute=FSBL
PF4.PinState=GPIO_PIN_SET
PF4.Signal=GPIO_Output
PF5.GPIOParameters=PinAttribute
PF5.Mode=RGB888
PF5.PinAttribute=Appli
PF5.Signal=LTDC_G0
PF6.ContextOwner=Appli
PF6.GPIOParameters=GPIO_Label,PinAttribute
PF6.GPIO_Label=VSYNC_FREQ
PF6.Locked=true
PF6.PinAttribute=Appli
PF6.Signal=GPIO_Output
PG0.GPIOParameters=PinAttribute
PG0.Mode=RGB888
PG0.PinAttribute=Appli
PG0.Signal=LTDC_R0
PG1.GPIOParameters=PinAttribute
PG1.Locked=true
PG1.Mode=RGB888
PG1.PinAttribute=Appli
PG1.Signal=LTDC_G1
PG10.ContextOwner=Appli
PG10.GPIOParameters=PinState,GPIO_Label,PinAttribute
PG10.GPIO_Label=LED_RED
